# # Принцип єдиного обов'язку
# # (Single Responsibility Principle - SRP)
# # Принцип SRP стверджує, що кожен клас повинен мати лише одну причину для зміни. Це означає, що клас
# # повинен виконувати лише одну конкретну функцію або обов'язок. Розділення функціональності між класами
# # допомагає зробити код більш зрозумілим та підтримуваним.
# # Уявімо, що ми створюємо клас Task, який представляє завдання. Він має відповідати тільки за представлення
# # завдання, а не за логіку видалення завдань.

# class Task:
#     def __init__(self, description) -> None:
#         self.description = description

# class TaskManager:
#     def delete_task(self, task):
#         # Логіка видалення завдання збереження історії

# # У цьому прикладі Task відповідає тільки за представлення завдання, а логіка видалення та збереження історії
# # розміщена в окремому класі TaskManager.